//1.假设现在有5个班，每个班10个人，设计一个二维数组存储这些人的年龄.
int stu[5][10] = {{0}};

//2.如果想知道第二个班的第6个人的年龄，应该如何获取？编译器该如何获取？
//索引
stu[1][5];
//编译器
stu[1*10+5]

//3.打印所有班级，所有学生的年龄(每个班级打印一行).
void Stu() {
    int stu[5][10] = {
        {1,2,3,4,5,6,7,8,9,0},
        {0,9,8,7,6,5,4,3,2,1},
        {5,4,3,2,1,0,9,8,7,6},
        {3,4,5,6,7,8,9,0,1,2},
        {1,2,3,4,5,6,7,8,9,0}
    };
    int n = 5, m = 10;
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < m; j++) {
            printf("%d ", stu[i][j]);
        }
        printf("\n");
    }
}
int main() {
	Stu();
}

//将第二个班级的超过20岁的学生的年龄修改为21岁.
void Stu2() {
     int stu[5][10] = {
        {1,2,13,4,52,6,7,8,39,0},
        {0,21,8,7,36,5,4,78,2,1},
        {5,4,33,2,1,30,9,8,7,62},
        {3,4,52,6,7,8,9,30,1,12},
        {1,21,3,4,53,6,7,8,91,0}
    };
        for(int j = 0;j<10;j++){
            if(stu[1][j]>20){
                stu[1][j] = 21;
            }
        }
 }

 //打印出每个班级学生的年龄的和.
 void Stu3() {
    int stu[5][10] = {
        {1,2,13,4,52,6,7,8,39,0},
        {0,21,8,7,36,5,4,78,2,1},
        {5,4,33,2,1,30,9,8,7,62},
        {3,4,52,6,7,8,9,30,1,12},
        {1,21,3,4,53,6,7,8,91,0}
    };
    int Sum = 0;
     for (int i = 0; i < 5; i++) {
        for (int j = 0; j < 10; j++) {
            Sum += stu[i][j];
        }
        printf("%d\n",Sum);
        Sum = 0;
    }
 }

//归并排序
//数组一：[3,5,7,9,12,25,34,55] k=0
//数组二：[4,7,9,11,13,16] j=0

void merge_sort() {
    int size1[8] = { 3,5,7,9,12,25,34,55 };
    int size2[6] = { 4,7,9,11,13,16 };
    int size[14] = { 0 };
    int i = 0, j = 0, t = 0;
    while (t < 14) {

        if (j == 6 ) {
            while (i < 8) {
                size[t++] = size1[i++];
            }
        }

        if (size1[i] < size2[j]) {
            size[t] = size1[i++];
        }
        else {
            if (size1[i] > size2[j]) {
                size[t] = size2[j++];
            }
            else {
                if (size1[i] == size2[j]) {
                    size[t] = size2[j++];
                    size[1+t++] = size1[i++];
                }
            }
        }
        t++;
    }
    for (int n = 0; n < 14; n++) {
        printf("%d\n", size[n]);
    }
}